<template>
  <div class="block">
      <div class="tit">
        <span align="right"><h4>도움말</h4></span>
        <div class="btnArea">
          <div class="help">
            <svg
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              xmlns:xlink="http://www.w3.org/1999/xlink"
              x="0px"
              y="0px"
              width="18px"
              height="18px"
              viewBox="0 0 20 20"
              enable-background="new 0 0 20 20"
              xml:space="preserve"
            >
              <path
                fill="#939393"
                d="M10,0C4.477,0,0,4.477,0,10s4.477,10,10,10s10-4.477,10-10S15.523,0,10,0z M11.391,16.107H8.745v-2.443
                    h2.646V16.107z M13.494,8.508c-0.164,0.396-0.362,0.734-0.589,1.008l-1.283,1.585c-0.129,0.149-0.221,0.338-0.275,0.566
                    c-0.061,0.247-0.092,0.561-0.092,0.933v0.25H8.864l-0.013-0.236c-0.032-0.59,0.042-1.114,0.222-1.558
                    c0.176-0.433,0.374-0.787,0.59-1.05l1.19-1.528c0.129-0.167,0.249-0.366,0.357-0.591c0.099-0.207,0.148-0.403,0.148-0.583
                    c0-0.394-0.116-0.712-0.356-0.973c-0.235-0.254-0.565-0.378-1.011-0.378c-0.439,0-0.763,0.13-0.987,0.396
                    c-0.234,0.28-0.349,0.574-0.349,0.9v0.25H6.252v-0.25c0-0.465,0.103-0.91,0.306-1.321c0.2-0.408,0.478-0.768,0.822-1.07
                    C7.725,4.565,8.124,4.33,8.572,4.156c0.887-0.345,1.906-0.345,2.816-0.031c0.451,0.156,0.854,0.384,1.198,0.676
                    c0.349,0.305,0.631,0.674,0.841,1.099c0.213,0.429,0.32,0.92,0.32,1.458C13.748,7.719,13.663,8.105,13.494,8.508z"
              />
            </svg>
            <div class="sub">
              <p>상태가 반려 or 취소가 아닌 일감 대상</p>
              <h6>누적</h6>
              <dl>
                <dt>계획</dt>
                <dd>계획시작일자 <= 누적종료일자</dd>
                <dt>실적</dt>
                <dd>
                    계획시작일자 <= 누적종료일자
                and 실제완료일자 <= 누적종료일자
                and 이슈 닫힘(완료상태)
                </dd>
                <dt>진행</dt>
                <dd>
                    계획시작일자 <= 누적종료일자
                and (실제완료일자 없음 or 실제완료일자 > 누적종료일자 or 닫힘(완료)상태 아님)
                and 계획완료일자 >= 누적종료일자
                </dd>
                <dt>지연</dt>
                <dd>
                    계획시작일자 <= 누적종료일자
                and (실제완료일자 없음 or 실제완료일자 > 누적종료일자 or 닫힘(완료)상태 아님)
                and 계획완료일자 < 누적종료일자
                </dd>
              </dl>
              <h6>주간</h6>
              <dl>
                <dt>계획</dt>
                <dd>
                    계획시작일자 <= 검색종료일자
                and 계획완료일자 >= 검색시작일자
                </dd>
                <dt>실적</dt>
                <dd>
                    계획시작일자 <= 검색종료일자
                and 계획완료일자 >= 검색시작일자
                and 실제완료일자 <= 검색종료일자
                and 닫힘(완료)상태
                </dd>
                <dt>진행</dt>
                <dd>
                    계획시작일자 <= 검색종료일자
                and 계획종료일자 >= 검색시작일자
                and (실제종료일자 없음 or 실제종료일자 > 검색종료일자 or 닫힘(완료)상태 아님)
                and 계획종료일자 >= 검색종료일자
                </dd>
                <dt>지연</dt>
                <dd>
                    계획시작일자 <= 검색종료일자
                and 계획종료일자 >= 검색시작일자
                and (실제종료일자 없음 or 실제종료일자 > 검색종료일자 or 닫힘(완료)상태 아님)
                and 계획종료일자 < 검색종료일자
                </dd>
              </dl>
            </div>
          </div>
        </div>
      </div>
    </div>
</template>

<script>
export default {
  inheritattrs: false,
  name: 'Help'
}
</script>
